#!/usr/bin/env python
#-*- coding:UTF-8 -*-

'''题目：两个3行3列的矩阵，实现其对应位置的数据相加，并返回一个新矩阵：
X = [[12,7,3],                Y = [[5,8,1],
    [4,5,6],                      [6,7,3],
    [7,8,9]]                      [4,5,9]]
程序分析：创建一个新的3行3列的矩阵，使用for迭代并取出X和Y矩阵中对应位置的值，相加后放到新矩阵的对应位置中。'''

X = [[12,7,3],
     [4,5,6],
     [7,8,9]]

Y = [[5,8,1],
     [6,7,3],
     [4,5,9]]

result = [[0,0,0],
          [0,0,0],
          [0,0,0]]

# 迭代输出行
for i in range(len(X)):
    # 迭代输出行
    for j in range(len(X[0])):
        result[i][j] = X[i][j] + Y[i][j]
for i in result:
    print(i)